In [1]:
import pandas as pd
#!pip install pandas

                Data Type in pandas
                there are two type of data types
                1. Series-----> 1d 
                2. DataFrame-----> 2d just like tabular format

In [4]:
l=[10,20,30,40,50,60,70,80,90,100]

In [5]:
s=pd.Series(l)

In [6]:
s

0     10
1     20
2     30
3     40
4     50
5     60
6     70
7     80
8     90
9    100
dtype: int64

In [10]:
s.dtypes

dtype('int64')

In [12]:
s.index=['a','b','c','d','e','f','g','h','i','j']

In [13]:
s

a     10
b     20
c     30
d     40
e     50
f     60
g     70
h     80
i     90
j    100
dtype: int64

In [14]:
s['d']

40

In [15]:
s.e

50

In [19]:
s['a']

10

In [20]:
s.a

10

In [21]:
s

a     10
b     20
c     30
d     40
e     50
f     60
g     70
h     80
i     90
j    100
dtype: int64

In [22]:
s['b':'f']

b    20
c    30
d    40
e    50
f    60
dtype: int64

In [23]:
max(s)

100

In [24]:
min(s)

10

In [27]:
s*2

a     20
b     40
c     60
d     80
e    100
f    120
g    140
h    160
i    180
j    200
dtype: int64

In [28]:
s.ndim

1

In [30]:
s.size

10

In [34]:
s

a     10
b     20
c     30
d     40
e     50
f     60
g     70
h     80
i     90
j    100
dtype: int64

In [52]:
d={'city':['jaipur','udaipur','jodhour','ajmer','alwar','tonk'],
  'temp':[30,32,31,28,29,33],
  'humidity':[70,75,74,77,72,54]}

In [53]:
d

{'city': ['jaipur', 'udaipur', 'jodhour', 'ajmer', 'alwar', 'tonk'],
 'temp': [30, 32, 31, 28, 29, 33],
 'humidity': [70, 75, 74, 77, 72, 54]}

In [54]:
df=pd.DataFrame(d)

In [55]:
df

      city  temp  humidity
0   jaipur    30        70
1  udaipur    32        75
2  jodhour    31        74
3    ajmer    28        77
4    alwar    29        72
5     tonk    33        54

In [62]:
df.index=['a','b','c','d','e','f']

In [47]:
df.loc['d']

city        ajmer
temp           28
humidity       77
Name: d, dtype: object

In [48]:
df.loc['e']

city        alwar
temp           29
humidity       72
Name: e, dtype: object

In [49]:
df

      city  temp  humidity
a   jaipur    30        70
b  udaipur    32        75
c  jodhour    31        74
d    ajmer    28        77
e    alwar    29        72
f     tonk    33        54

In [50]:
df.dtypes

city        object
temp         int64
humidity     int64
dtype: object

In [51]:
df.index

Index(['a', 'b', 'c', 'd', 'e', 'f'], dtype='object')

In [56]:
# if you have object indexing then you will use loc for slice or get a particular row
# for integer indexing use   iloc

In [63]:
df

      city  temp  humidity
a   jaipur    30        70
b  udaipur    32        75
c  jodhour    31        74
d    ajmer    28        77
e    alwar    29        72
f     tonk    33        54

In [68]:
df.loc['a':'e':2]

      city  temp  humidity
a   jaipur    30        70
c  jodhour    31        74
e    alwar    29        72

In [78]:
sr=[10,11,12,13,14,15]

In [70]:
s1=pd.Series(sr)

In [71]:
s1

0    10
1    11
2    12
3    13
4    14
5    15
6    16
dtype: int64

In [79]:
df['sr']=sr

In [81]:
df.index=df.sr

In [87]:
df.drop('sr',axis=1)

       city  temp  humidity
sr
10   jaipur    30        70
11  udaipur    32        75
12  jodhour    31        74
13    ajmer    28        77
14    alwar    29        72
15     tonk    33        54

In [92]:
df.loc[12:15:2]

       city  temp  humidity  sr
sr
12  jodhour    31        74  12
14    alwar    29        72  14

In [94]:
df.city

sr
10     jaipur
11    udaipur
12    jodhour
13      ajmer
14      alwar
15       tonk
Name: city, dtype: object

In [95]:
df['city']

sr
10     jaipur
11    udaipur
12    jodhour
13      ajmer
14      alwar
15       tonk
Name: city, dtype: object

In [96]:
df

       city  temp  humidity  sr
sr
10   jaipur    30        70  10
11  udaipur    32        75  11
12  jodhour    31        74  12
13    ajmer    28        77  13
14    alwar    29        72  14
15     tonk    33        54  15

In [100]:
df[['city','humidity']].loc[12:15]

       city  humidity
sr
12  jodhour        74
13    ajmer        77
14    alwar        72
15     tonk        54